---
title: CableTraySizeIterator
classe: Autodesk.Revit.DB.Electrical.CableTraySizeIterator
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# CableTraySizeIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `MEPSize Current { get; }` | `cableTraySizeIterator.Current` | MEPSize |
| `Boolean IsValidObject { get; }` | `cableTraySizeIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `cableTraySizeIterator.Dispose()` | Void |
| `MEPSize GetCurrent()` | `cableTraySizeIterator.GetCurrent()` | MEPSize |
| `Boolean HasCurrent()` | `cableTraySizeIterator.HasCurrent()` | Boolean |
| `Boolean IsDone()` | `cableTraySizeIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `cableTraySizeIterator.MoveNext()` | Boolean |
| `Void Reset()` | `cableTraySizeIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```